// AVP Prague stamp begin( Interface header,  )
// -------- ANSI C++ Code Generator 1.0 --------
// -------- Wednesday,  19 December 2007,  11:39 --------
// -------------------------------------------
// Copyright © Kaspersky Lab 1996-2006.
// -------------------------------------------
// Project     -- Not defined
// Sub project -- Not defined
// Purpose     -- Not defined
// Author      -- Mezhuev
// File Name   -- processmonitor.cpp
// -------------------------------------------
// AVP Prague stamp end



#define IMPEX_DEF

// AVP Prague stamp begin( Interface version,  )
#define ProcessMonitor_VERSION ((tVERSION)1)
// AVP Prague stamp end



// AVP Prague stamp begin( Header includes,  )
#include <Prague/prague.h>
#include <Prague/iface/i_root.h>
#include <Prague/pr_vtbl.h>
#include <Prague/iface/i_reg.h>
#include <ProductCore/iface/i_task.h>
#include <ProductCore/plugin/p_processmonitor.h>
// AVP Prague stamp end



#include <ProductCore/structs/ProcMonM.h>

// AVP Prague stamp begin( Includes for interface,  )
#include "processmonitor.h"
// AVP Prague stamp end



#include <Prague/iface/e_loader.h>
#include <Prague/plugin/p_win32_nfio.h>
#include <Prague/pr_time.h>
#include <ProductCore/iptoa.h>

#include <windows.h>
#include <wchar.h>

#include "events.h"
#include <../../PDM/PDM2/eventmgr/include/eventhandler.h>

#ifdef _WIN32
#include "mscat.h"
#endif

#include "netutil.h"
#include <Mail/plugin/p_httpscan.h>

// AVP Prague stamp begin( Global property variable declaration,  )
// Interface "ProcessMonitor". Static(shared) property table variables
// AVP Prague stamp end



typedef struct _tag_ProcessTriggers
{
	ULONG		m_Triggers;
	cIP		    m_Host;
	WORD		m_Port;
} tProcessTriggers;

class cProcmonEventHandler : public cEventHandler {
public:
	cProcmonEventHandler(CProcMon* pProcMon) : m_pProcMon(pProcMon) {};
	~cProcmonEventHandler() {};

	_IMPLEMENT(OnProcessCreatePost);
	_IMPLEMENT(OnProcessExitPost);

private:
	CProcMon* m_pProcMon;
};


void cProcmonEventHandler::OnProcessCreatePost(cEvent& event, tPid new_process_pid, cFile& image_path, cPath& working_folder, tcstring cmd_line, uint32_t creation_flags)
{
	PR_TRACE((m_pProcMon, prtIMPORTANT, TR "PM: ProcessCreatePost %I64d(0x%I64x) %S", new_process_pid, new_process_pid, image_path.getFull() ));

	////cProcMonNotify Notify;
	cProcMonNotifyEx Notify;
	m_pEnvironmentHelper->DriverPending(event, 1000);
	m_pProcMon->AddActiveImage(image_path.getFull());
	{
		cProcess pProcess = m_pProcessList->FindProcess(new_process_pid);
		if (!pProcess)
			return;
		m_pProcMon->FillTriggers2(pProcess);
		m_pProcMon->AssignToNotify(&Notify, pProcess);
	}
	// calculate time from process start to now
	int64_t nTimeDelay = m_pEnvironmentHelper->GetTimeLocal() - event.GetTime();
	nTimeDelay /= 10L*1000L*1000L; // to seconds
	if (nTimeDelay >= 0 && nTimeDelay < 10) // new process
	{
		m_pEnvironmentHelper->DriverPending(event, 35000);
		m_pProcMon->GetProcessInfoEx(new_process_pid, &Notify.m_SecRating);
		////cSecurityRating rating;
		////if (PR_SUCC(m_pProcMon->GetProcessInfoEx(new_process_pid, &&rating)))
		////	m_pProcMon->sysSendMsg(pmc_PROCESS_MONITOR, pm_PROCESS_MONITOR_PROCESS_START_WITH_RATING, m_pProcMon, &rating, SER_SENDMSG_PSIZE);
	}
	////m_pProcMon->sysSendMsg(pmc_PROCESS_MONITOR, pm_PROCESS_MONITOR_PROCESS_START, m_pProcMon, &Notify, SER_SENDMSG_PSIZE);
	m_pProcMon->sysSendMsg(pmc_PROCESS_MONITOR, pm_PROCESS_MONITOR_PROCESS_START, m_pProcMon, &Notify, SER_SENDMSG_PSIZE);
}

void cProcmonEventHandler::OnProcessExitPost(cEvent& event)
{
	cProcess pProcess = event.GetProcess();
	PR_TRACE((m_pProcMon, prtIMPORTANT, TR "PM: ProcessExitPost %I64d(0x%I64x) %S", event.m_pid, event.m_pid, pProcess ? pProcess->m_orig_image.getFull() : L"<UNKNOWN>" ));
	if (!pProcess)
		return;
	tDWORD n = 0;
	tProcessInfo pi;
	m_pProcMon->m_ReportDB->GetEvents(0, pProcess->m_uniq_pid, &pi, sizeof(pi), 1, &n);
	if (n != 1)
		return;
	pi.m_ftExitTime = event.GetTime();
	m_pProcMon->m_ReportDB->UpdateEvent(pProcess->m_uniq_pid, &pi, sizeof(pi));

	cProcMonNotify Notify;
	m_pProcMon->AssignToNotify(&Notify, pProcess);
	m_pProcMon->sysSendMsg(pmc_PROCESS_MONITOR, pm_PROCESS_MONITOR_PROCESS_EXIT, m_pProcMon, &Notify, SER_SENDMSG_PSIZE);
}

class cAutoPrMemFree
{
public:
	cAutoPrMemFree(hOBJECT hObj, void** ppMem) : m_ppMem(ppMem), m_hObj(hObj) {};
	~cAutoPrMemFree()
	{
		if (m_ppMem && *m_ppMem)
		{
			(m_hObj?m_hObj:*g_root)->heapFree(*m_ppMem);
			*m_ppMem = NULL;
		}
	}
private:
	void** m_ppMem;
	hOBJECT m_hObj;
};

LONG gMemCounter = 0;

void* __stdcall pfMemAlloc (
	PVOID pOpaquePtr,
	SIZE_T size,
	ULONG tag
	)
{
	tERROR error;
	CProcMon* pProcMon = (CProcMon*) pOpaquePtr;
	void* ptr = NULL;

	error = pProcMon->heapAlloc((tPTR*)&ptr, size);
	if (PR_SUCC(error))
	{
		InterlockedIncrement(&gMemCounter);

		return ptr;
	}

	return NULL;
};

void __stdcall pfMemFree (
	PVOID pOpaquePtr,
	void** pptr
	)
{
	if (!*pptr)
		return;

	CProcMon* pProcMon = (CProcMon*) pOpaquePtr;

	pProcMon->heapFree(*pptr);
	*pptr = NULL;
	InterlockedDecrement(&gMemCounter);
};


// AVP Prague stamp begin( Internal (kernel called) interface method implementation, ObjectInitDone )
// Extended method comment
//    Notification that all necessary properties have been set and object must go to operation state
// Result comment
//    Returns value differ from errOK if object cannot function properly
// Parameters are:
tERROR CProcMon::ObjectInitDone()
{
	tERROR error = errOK;
	PR_TRACE_FUNC_FRAME( "ProcessMonitor::ObjectInitDone method" );

	if( PR_SUCC(error) )
		error = sysCreateObjectQuick((hOBJECT*)&m_lock, IID_CRITICAL_SECTION);

	if( PR_SUCC(error) )
		error = sysCreateObjectQuick((hOBJECT*)&m_hash, IID_HASH, PID_HASH_MD5);

#ifdef _WIN32
	cStringObj sCatCacheDat(L"%Data%\\catcache.dat");
	sysSendMsg(pmc_PRODUCT_ENVIRONMENT, pm_EXPAND_ENVIRONMENT_STRING, (hOBJECT)cAutoString(sCatCacheDat), 0, 0);
	m_pMSCatCache = GetMSCatCache(sCatCacheDat.data());
#endif

	if (PR_SUCC(error))
		error = m_tm->GetService(TASKID_TM_ITSELF, *this, REPORTDB_SERVICE_NAME, (hOBJECT*)&m_ReportDB);

	if (PR_SUCC(error))
	{
		m_pEventProvider = new cProcmonEventProvider(this);
		if (!m_pEventProvider)
			error = errOBJECT_CANNOT_BE_INITIALIZED;
		else
		{
			error = m_pEventProvider->Init();
			if (PR_FAIL(error))
			{
				delete m_pEventProvider;
				m_pEventProvider = NULL;
				error = errOK;
			}
			if( m_pEventProvider )
				m_pEventProvider->m_event_mgr.m_pProcessList->AllocSlot(&m_nTriggersSlot);
		}
	}


	if (PR_SUCC(error) && m_pEventProvider)
	{
		m_pEventHandlerProcMon = new cProcmonEventHandler(this);
		if (!m_pEventHandlerProcMon)
			return errNOT_ENOUGH_MEMORY;
		error = RegisterEventHandler(m_pEventHandlerProcMon, 0);
		if (PR_SUCC(error))
			m_pEventProvider->RegisterProcessesOnStart();
	}

	if (PR_SUCC(error))
	{
		tERROR error;
		hSCHEDULER scheduler = NULL;
		error = m_tm->GetService(TASKID_TM_ITSELF, *this, sid_TM_SCHEDULER, (cObject**)&scheduler);
		if (PR_SUCC(error) && scheduler)
		{
			cScheduleSettings schedule;
			schedule.m_bRaiseIfSkipped = cTRUE;
			schedule.m_TimeShift.dwSeconds = 10;
			error = scheduler->SetSchedule(pmc_PROCESS_MONITOR, pm_PROCESS_MONITOR_SCHEDULE_GET_PREFETCH, &schedule, NULL);
			m_tm->ReleaseService(TASKID_TM_ITSELF, (hOBJECT)scheduler);
		}
		if (PR_SUCC(error))
		{
			PR_TRACE((this, prtIMPORTANT, "pmn\tGet prefetch scheduled..."));
		}
		else
		{
			PR_TRACE((this, prtIMPORTANT, "pmn\tprefetch schedule FAILED"));
		}
	}

	if (PR_SUCC(error))
	{
		tMsgHandlerDescr hdls[] =
		{
			{ *this, rmhDECIDER, pmc_PRODUCT_REQUEST, IID_ANY, PID_ANY, IID_ANY, PID_ANY },
			{ *this, rmhDECIDER, pmc_PROCESS_MONITOR, IID_ANY, PID_ANY, IID_ANY, PID_ANY },
			{ *this, rmhLISTENER, pmcTM_EVENTS, IID_ANY, PID_ANY, IID_ANY, PID_ANY },
			{ *this, rmhLISTENER, pmc_HTTPSCAN_PROCESS, IID_ANY, PID_ANY, IID_ANY, PID_ANY },
		};
		error = m_tm->sysRegisterMsgHandlerList(hdls, countof(hdls));
	}

	if (PR_SUCC(error))
	{
		if (!NetUtilInit())
			error = errOBJECT_CANNOT_BE_INITIALIZED;
	}

	PR_TRACE((g_root, prtIMPORTANT, "pmn\tObjectInitDone result %terr", error ));

	return error;
}
// AVP Prague stamp end



// AVP Prague stamp begin( Internal (kernel called) interface method implementation, ObjectPreClose )
// Extended method comment
//    Kernel warns object it is going to close all children
// Behaviour comment
//    Object takes all necessary "before preclosing" actions
// Parameters are:
tERROR CProcMon::ObjectPreClose()
{
	tERROR error = errOK;
	PR_TRACE_FUNC_FRAME( "ProcessMonitor::ObjectPreClose method" );

	// Place your code here
	if (m_pEventProvider && m_pEventHandlerProcMon)
	{
		UnregisterEventHandler(m_pEventHandlerProcMon);
		delete m_pEventHandlerProcMon;
	}

	if (m_pEventProvider)
		m_pEventProvider->Done();

	if (m_ReportDB)
		m_tm->ReleaseService(TASKID_TM_ITSELF, (hOBJECT)m_ReportDB);

	CloseAvsSession();

	if (m_hAvs)
		m_tm->ReleaseService(TASKID_TM_ITSELF, (hOBJECT)m_hAvs);

#ifdef _WIN32
	if (m_pMSCatCache)
		ReleaseMSCatCache(m_pMSCatCache);
#endif

	NetUtilDone();

	return error;
}
// AVP Prague stamp end



// AVP Prague stamp begin( Internal (kernel called) interface method implementation, ObjectClose )
// Extended method comment
//    Kernel warns object it must be closed
// Behaviour comment
//    Object takes all necessary "before closing" actions
// Parameters are:
tERROR CProcMon::ObjectClose()
{
	tERROR error = errOK;
	PR_TRACE_FUNC_FRAME( "ProcessMonitor::ObjectClose method" );

	// Place your code here
	if (m_pEventProvider)
	{
		delete m_pEventProvider;
		m_pEventProvider = NULL;
	}

	if (gMemCounter)
	{
		PR_TRACE((this, prtERROR, "pmn\tProcMon - left counter %d", gMemCounter));
	}

	return error;
}
// AVP Prague stamp end



void CProcMon::AssignToNotify(cProcMonNotify* pNotify, cProcess& pProcess)
{
	pNotify->m_sImagePath = pProcess->m_orig_image.getFull();
	pNotify->m_ProcessId = (tDWORD)pProcess->m_pid;
	pNotify->m_ParentProcessId = (tDWORD)pProcess->m_parent_pid;
	pNotify->m_tStart = pProcess->m_ftStartTime ? FILETIME_TO_TIMET(pProcess->m_ftStartTime) : 0;
	pNotify->m_tExit = pProcess->m_ftExitTime ? FILETIME_TO_TIMET(pProcess->m_ftExitTime) : 0;
}



// AVP Prague stamp begin( Internal (kernel called) interface method implementation, MsgReceive )
// Extended method comment
//    Receives message sent to the object or to the one of the object parents as broadcast
// Parameters are:
//   "msg_cls_id"    : Message class identifier
//   "msg_id"        : Message identifier
//   "send_point"    : Object where the message was send initially
//   "ctx"           : Context of the object processing
//   "receive_point" : Point of distributing message (tree top for RegisterMsgHandler call
//   "par_buf"       : Buffer of the parameters
//   "par_buf_len"   : Lenght of the buffer of the parameters
tERROR CProcMon::MsgReceive( tDWORD p_msg_cls_id, tDWORD p_msg_id, hOBJECT p_send_point, hOBJECT p_ctx, hOBJECT p_receive_point, tVOID* p_par_buf, tDWORD* p_par_buf_len )
{
	tERROR error = errOK;
	PR_TRACE_FUNC_FRAME( "ProcessMonitor::MsgReceive method" );

	// Place your code here
	if (pmc_HTTPSCAN_PROCESS == p_msg_cls_id)
	{
		// check params
		PR_TRACE((this, prtNOTIFY, TR "pmc_HTTPSCAN_PROCESS p_ctx=%X", p_ctx));
		if (!p_ctx)
			return errOK;
		if (PR_FAIL(sysCheckObject(p_ctx, IID_IO)))
			return errOK;
		if (p_par_buf_len != SER_SENDMSG_PSIZE)
			return errOK;
		PR_TRACE((this, prtNOTIFY, TR "pmc_HTTPSCAN_PROCESS2"));
		OnFileDownload((hIO)p_ctx, (cSerializable*)p_par_buf);
		return errOK;
	}

	if( p_msg_cls_id == pmc_PRODUCT_REQUEST )
	{
		switch( p_msg_id )
		{
		case pm_PRODUCT_REQUEST_TRUSTEDAPPS:
			if( p_par_buf_len != SER_SENDMSG_PSIZE)
				return errOK;
			if (PR_SUCC(GetSettings((cSerializable*)p_par_buf)) )
				return errOK_DECIDED;
			return errOK;
			
		case pm_PRODUCT_REQUEST_APPHASH:
			if( PR_SUCC(CalcObjectHash(p_ctx, (tQWORD*)p_par_buf)) )
				return errOK_DECIDED;
			return errOK;
		}
	}

	if (p_msg_cls_id == pmc_PROCESS_MONITOR)
	{
		PR_TRACE((g_root, prtIMPORTANT, "pmn\tMsgReceive pmc_PROCESS_MONITOR:0x%x", p_msg_id ));

		switch (p_msg_id)
		{
		case cCalcSecurityRatingProgress::eIID:
			{
				if (!p_par_buf || (SER_SENDMSG_PSIZE != p_par_buf_len))
					return errPARAMETER_INVALID;
				cCalcSecurityRatingProgress* pProgress = (cCalcSecurityRatingProgress*) p_par_buf;
				if (!pProgress->isBasedOn(cCalcSecurityRatingProgress::eIID))
					return errPARAMETER_INVALID;
				if (pProgress->m_nActionId == cCalcSecurityRatingProgress::eCancelNotification)
				{
					sProcMonInternalContext* pContext = (sProcMonInternalContext*)pProgress->m_pContext;
					if (pContext)
					{
						pContext->m_bStop = true;
						return errOK_DECIDED;
					}
				}
				return errOK;
			}
		case pm_PROCESS_MONITOR_GETINFO:
			{
				if (!p_par_buf || (SER_SENDMSG_PSIZE != p_par_buf_len))
					return errPARAMETER_INVALID;
				cProcMonNotify* pProcMonNotify = (cProcMonNotify*) p_par_buf;
				if (!pProcMonNotify->isBasedOn(cProcMonNotify::eIID))
					return errPARAMETER_INVALID;
				if (!m_pEventProvider)
					return errNOT_READY;
				cProcess pProcess = m_pEventProvider->m_event_mgr.m_pProcessList->FindProcess(pProcMonNotify->m_ProcessId);
				if (!pProcess)
					return errNOT_FOUND;
				AssignToNotify(pProcMonNotify, pProcess);
				return errOK_DECIDED;
			}
			break;

		case pm_PROCESS_MONITOR_SCHEDULE_GET_PREFETCH:
			error = GetPrefetch();
			break;

		case pm_PROCESS_MONITOR_ADD_ACTIVE_IMAGE:
			error = AddActiveImage((tWCHAR*)p_par_buf);
			break;

		case pm_PROCESS_MONITOR_IS_ACTIVE_IMAGE:
			error = IsImageActive((tWCHAR*)p_par_buf, NULL);
			break;
			
		case pm_PROCESS_MONITOR_PROCESS_GETACTIONMASK:
			{
				if (!m_pEventProvider)
					return errOBJECT_NOT_INITIALIZED;
				if( !p_par_buf || !p_par_buf_len || (*p_par_buf_len != sizeof(cPRCMRequest)))
					return errPARAMETER_INVALID;
				cPRCMRequest* pReq = (cPRCMRequest*) p_par_buf;
				cProcess pProcess = m_pEventProvider->m_event_mgr.m_pProcessList->FindProcess(pReq->m_ProcessId);
				if (!pProcess)
					break;
				tProcessTriggers* pTriggers = (tProcessTriggers*)pProcess->GetSlotData(m_nTriggersSlot, sizeof(tProcessTriggers));
				if (!pTriggers)
					break;
				cBLTrustedApp::Triggers Trigs = (cBLTrustedApp::Triggers)pTriggers->m_Triggers;

				PR_TRACE((g_root, prtIMPORTANT, "pmn\tGetActionMask - pid %d, req 0x%x, trigs 0x%x",
					pReq->m_ProcessId, pReq->m_Request, Trigs));

				switch (pReq->m_Request)
				{
				case cPRCMRequest::_ePrcmn_ExclOpenFiles:
					return (Trigs & cBLTrustedApp::fExclOpenFiles ? errOK_DECIDED : errOK );
			
				case cPRCMRequest::_ePrcmn_ExclBehavior:
					return (Trigs & cBLTrustedApp::fExclBehavior ? errOK_DECIDED : errOK );

				case cPRCMRequest::_ePrcmn_ExclRegistry:
					return (Trigs & cBLTrustedApp::fExclRegistry ? errOK_DECIDED : errOK );
					
				case cPRCMRequest::_ePrcmn_ExclTraffic:
					if((Trigs & cBLTrustedApp::fExclNet) &&
						(!(Trigs & cBLTrustedApp::fExclNetHost) || pReq->m_Host  == pTriggers->m_Host) &&
						(!(Trigs & cBLTrustedApp::fExclNetPort) || pReq->m_nPort == pTriggers->m_Port))
						return errOK_DECIDED;
					return errOK;
					break;

				default:
					error = errMETHOD_NOT_FOUND;
					break;
				}
			}
			break;

		case pm_PROCESS_MONITOR_CHECKINTASKLIST:
			{
				if (!p_par_buf || (SER_SENDMSG_PSIZE != p_par_buf_len))
					return errPARAMETER_INVALID;
				cTaskSleepingMode* pTaskSleep = (cTaskSleepingMode*) p_par_buf;
				error = errNOT_FOUND;
				tPid* arrPids = NULL;
				size_t nPidCount = 0;
				cProcessList* pProcessList = m_pEventProvider->m_event_mgr.m_pProcessList;
				if (!pProcessList->GetSnapshot(&arrPids, &nPidCount))
					return errNOT_FOUND;
				for (tDWORD cou = 0; cou < pTaskSleep->m_aAppList.count(); cou++)
				{
					cTaskSleepingAppItem& enit = pTaskSleep->m_aAppList[cou];
					if (!enit.m_bEnabled)
						continue;
					bool bFound = false;
					for (size_t i=0; i<nPidCount; i++)
					{
						cProcess pProcess = pProcessList->FindProcess(arrPids[i]);
						if (!pProcess)
							continue;
						if (pProcess->m_ftExitTime!=0)
							continue;
						cStringObj strtmp = pProcess->m_orig_image.getFull();
						#pragma message(__FILE__LINE__ "TODO: CHANGE compare to pattern check!")
						bFound = !strtmp.compare(enit.m_sName, fSTRING_COMPARE_CASE_INSENSITIVE | fSTRING_COMPARE_SLASH_INSENSITIVE);
					}
					if( bFound )
						error = enit.m_bTriggered ? errOK : errOK_DECIDED;
					enit.m_bTriggered = !!bFound;
				}
				pProcessList->ReleaseSnapshot(&arrPids);
				return error;
			}
			break;
		
		default:
			error = errMETHOD_NOT_FOUND;
		}
	}

	if( p_msg_cls_id == pmcTM_EVENTS && p_msg_id == pmTM_EVENT_GOING_TO_STOP )
		CloseAvsSession();

	return error;
}
// AVP Prague stamp end



#define MAGIC_ASCC 0x43435341 // 'ASCC'

typedef struct tag_PREFETCH_DATA {
	DWORD dwVersion;           // 0x00 // = 0x11
	DWORD dwMagic;             // 0x04 // = 0x43435341 = 'ASCC'
	DWORD dwDataSize;          // 0x08 // total size
	WCHAR wcImageName[30];     // 0x0C // application image name, "NTOSBOOT" for boot process
	DWORD dwPathHash;          // 0x48 // hash or 0xB00DFAAD for boot process
	DWORD dwUnknown1;          // 0x4C // 1?
	DWORD dwEndOfNamesBlock;   // 0x50 // 
	DWORD dwUnknown2;          // 0x54 // names count?
	DWORD dwNamesOffset;       // 0x58 // start of names block
	DWORD dwNamesCount;        // 0x5C
	DWORD dwVolumesInfoOffset; // 0x60
	DWORD dwVolumesInfoCount;  // 0x64
	DWORD dwUnknown6;          // 0x68 // 0x8E=142
	DWORD dwUnknown7;          // 0x6C // 0
	DWORD dwUnknown8;          // 0x70 // 0xF8D8F200
	DWORD dwUnknown9;          // 0x74 // 0xFFFFFFFF
	DWORD dwUnknown10;         // 0x78 // 0x5650
	DWORD dwUnknown11;         // 0x7C // 0x59FC
	DWORD dwUnknown12;         // 0x80 // 0x1937
	DWORD dwUnknown13;         // 0x84 // 0x3FE
	DWORD dwUnknown14;         // 0x88 // 0x539
	DWORD dwUnknown15;         // 0x8C // 0
	DWORD dwUnknown16;         // 0x90 // 0
	DWORD dwUnknown17;         // 0x94 // 0
	DWORD dwUnknown18;         // 0x98 // 0
	DWORD dwUnknown19;         // 0x9C // 0
	FILETIME ftTimeStamp;      // 0xA0
} PREFETCH_DATA;

typedef struct tag_PREFETCH_NAME_DATA {
	WORD wSize;
	WORD wFlags;
	WCHAR wcName[1];
} PREFETCH_NAME_DATA;

#define PREFETCH_FLAG_DIRECTORY  1

tERROR CProcMon::GetImageNameHash(const tWCHAR* wcsFileName, tQWORD* pqwHash)
{
	tERROR error = errOK;
	tWCHAR* pwchBuffer = NULL;
	tUINT nDeviceNameLen = 0;
	DWORD dwHash[4];
	cAutoPrMemFree _freeData(*this, (void**)&pwchBuffer);

	if (!wcsFileName)
		return errPARAMETER_INVALID;

	while (wcsFileName[0] == '\\' || wcsFileName[0] == '?')
		wcsFileName++;

	error = heapAlloc((tPTR*)&pwchBuffer, (wcslen(wcsFileName)+1+MAX_PATH*2)*sizeof(tWCHAR));
	if (PR_FAIL(error))
		return error;
	
	wcscpy(pwchBuffer+nDeviceNameLen, wcsFileName);
	wcsFileName = pwchBuffer;
	while (wcsFileName[0] == '\\' || wcsFileName[0] == '?')
		wcsFileName++;
	if (wcsFileName[0] == 0)
	{
		PR_TRACE((this, prtERROR, "pmn\tGetImageNameHash <reparsed name empty>"));
		return errNOT_OK;
