<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<!-- saved from url=(0029)http://www.helpandmanual.com/ -->
<head><script type="text/javascript" src="helpman_topicinit.js"></script>
<!-- Redirect browser to frame page if page is not in the content frame. -->
<script type="text/javascript">
<!--
if(top.frames.length==0) { top.location.href="index.html?faq_12.htm"; }
else { parent.quicksync('a14.11'); }
//-->
</script>
   <title>&#1042; &#1093;&#1086;&#1076;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; AVZ &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &quot;test&quot;</title>
   <meta name="keywords" content="">
    <meta http-equiv="Content-Type" content="text/html; charset=Windows-1251" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->


<body bgcolor="#FFFFFF">
<div id="hmpopupDiv" style="visibility:hidden; position:absolute; z-index:1000;"></div>


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">&#1042; &#1093;&#1086;&#1076;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; AVZ &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; "test"</span></p>

    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="t_about.htm">Наверх</a>&nbsp;
     <a href="faq_11.htm">Предыдущая</a>&nbsp;
     <a href="faq_13.htm">Последующая</a>
     </font><B>|</B>
<!--Rating@Mail.ru COUNTER--><script language="JavaScript" type="text/javascript"><!--
d=document;var a='';a+=';r='+escape(d.referrer)
js=10//--></script><script language="JavaScript1.1" type="text/javascript"><!--
a+=';j='+navigator.javaEnabled()
js=11//--></script><script language="JavaScript1.2" type="text/javascript"><!--
s=screen;a+=';s='+s.width+'*'+s.height
a+=';d='+(s.colorDepth?s.colorDepth:s.pixelDepth)
js=12//--></script><script language="JavaScript1.3" type="text/javascript"><!--
js=13//--></script><script language="JavaScript" type="text/javascript"><!--
d.write('<a href="http://top.mail.ru/jump?from=717989"'+
' target=_top><img src="http://top.list.ru/counter'+
'?id=717989;t=109;js='+js+a+';rand='+Math.random()+
'" alt="Рейтинг@Mail.ru"'+' border=0 height=18 width=88/><\/a>')
if(11<js)d.write('<'+'!-- ')//--></script><noscript><a
target=_top href="http://top.mail.ru/jump?from=717989"><img
src="http://top.list.ru/counter?js=na;id=717989;t=109"
border=0 height=18 width=88
alt="Рейтинг@Mail.ru"/></a></noscript><script language="JavaScript" type="text/javascript"><!--
if(11<js)d.write('--'+'>')//--></script><!--/COUNTER-->

    </td>
  </tr>
</table>
<br>

<p>&#1042; &#1093;&#1086;&#1076;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; AVZ &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1072; &#1076;&#1083;&#1080;&#1085;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1072; (&#1090;&#1080;&#1087;&#1086;&#1074;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; - &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1086; test). &#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; - &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1072;&#1085;&#1090;&#1080;&#1082;&#1077;&#1081;&#1083;&#1086;&#1075;&#1075;&#1077;&#1088;&#1072; AVZ, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;. &#1044;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088; &#1101;&#1084;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072; "&#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1072;" &#1080; "&#1084;&#1099;&#1096;&#1100;", &#1080; &#1080;&#1079;&#1091;&#1095;&#1072;&#1077;&#1090; &#1088;&#1077;&#1072;&#1082;&#1094;&#1080;&#1102; &#1085;&#1072; &#1085;&#1080;&#1093; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;. &#1045;&#1089;&#1083;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; AVZ, &#1090;&#1086; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;, &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074;&#1099;&#1096;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;.</p>


<!--Rating@Mail.ru COUNTER--><script language="JavaScript" type="text/javascript"><!--
d=document;var a='';a+=';r='+escape(d.referrer)
js=10//--></script><script language="JavaScript1.1" type="text/javascript"><!--
a+=';j='+navigator.javaEnabled()
js=11//--></script><script language="JavaScript1.2" type="text/javascript"><!--
s=screen;a+=';s='+s.width+'*'+s.height
a+=';d='+(s.colorDepth?s.colorDepth:s.pixelDepth)
js=12//--></script><script language="JavaScript1.3" type="text/javascript"><!--
js=13//--></script><script language="JavaScript" type="text/javascript"><!--
d.write('<img src="http://top.list.ru/counter'+
'?id=717989;js='+js+a+';rand='+Math.random()+
'" height=1 width=1/>')
if(11<js)d.write('<'+'!-- ')//--></script><noscript><img
src="http://top.list.ru/counter?js=na;id=717989"
height=1 width=1 alt=""/></noscript><script language="JavaScript" type="text/javascript"><!--
if(11<js)d.write('--'+'>')//--></script><!--/COUNTER-->


</body>
</html>
