<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<!-- saved from url=(0029)http://www.helpandmanual.com/ -->
<head><script type="text/javascript" src="helpman_topicinit.js"></script>
<!-- Redirect browser to frame page if page is not in the content frame. -->
<script type="text/javascript">
<!--
if(top.frames.length==0) { top.location.href="index.html?script_executewizard.htm"; }
else { parent.quicksync('a15.20.7'); }
//-->
</script>
   <title>function ExecuteWizard</title>
   <meta name="keywords" content="">
    <meta http-equiv="Content-Type" content="text/html; charset=Windows-1251" />
   <link type="text/css" href="default.css" rel="stylesheet" />
</head>


  <!-- Redirect browser to index page if page is not in the content frame.
       This script is only valid for regular HTML export -->


<body bgcolor="#FFFFFF">
<div id="hmpopupDiv" style="visibility:hidden; position:absolute; z-index:1000;"></div>


<table width="100%" border="0" cellspacing="0" cellpadding="2" bgcolor="#C0C0C0">
  <tr>
    <td align="left">
      <p class="p_Heading1"><span class="f_Heading1">function ExecuteWizard</span></p>

    </td>
    <td align="right">
     <font face="Arial" size="2">
     <a href="t_about.htm">Наверх</a>&nbsp;
     <a href="script_executesyscheckex.htm">Предыдущая</a>&nbsp;
     <a href="script_executesysclean.htm">Последующая</a>
     </font><B>|</B>
<!--Rating@Mail.ru COUNTER--><script language="JavaScript" type="text/javascript"><!--
d=document;var a='';a+=';r='+escape(d.referrer)
js=10//--></script><script language="JavaScript1.1" type="text/javascript"><!--
a+=';j='+navigator.javaEnabled()
js=11//--></script><script language="JavaScript1.2" type="text/javascript"><!--
s=screen;a+=';s='+s.width+'*'+s.height
a+=';d='+(s.colorDepth?s.colorDepth:s.pixelDepth)
js=12//--></script><script language="JavaScript1.3" type="text/javascript"><!--
js=13//--></script><script language="JavaScript" type="text/javascript"><!--
d.write('<a href="http://top.mail.ru/jump?from=717989"'+
' target=_top><img src="http://top.list.ru/counter'+
'?id=717989;t=109;js='+js+a+';rand='+Math.random()+
'" alt="Рейтинг@Mail.ru"'+' border=0 height=18 width=88/><\/a>')
if(11<js)d.write('<'+'!-- ')//--></script><noscript><a
target=_top href="http://top.mail.ru/jump?from=717989"><img
src="http://top.list.ru/counter?js=na;id=717989;t=109"
border=0 height=18 width=88
alt="Рейтинг@Mail.ru"/></a></noscript><script language="JavaScript" type="text/javascript"><!--
if(11<js)d.write('--'+'>')//--></script><!--/COUNTER-->

    </td>
  </tr>
</table>
<br>

<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">function</span><span class="f_CodeExample" style="color: #000000;">&nbsp;&nbsp;ExecuteWizard(ADBName&nbsp;:&nbsp;</span><span class="f_CodeExample" style="font-weight: bold; color: #000000;">string</span><span class="f_CodeExample" style="color: #000000;">;&nbsp;ACheckLevel,&nbsp;AFixLevel&nbsp;:&nbsp;integer;&nbsp;</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;AUseBackup&nbsp;:&nbsp;boolean)&nbsp;:&nbsp;integer;</span></p>
<p>&nbsp;</p>
<p>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1080; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1080; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1077;&#1076;&#1077;&#1090; &#1073;&#1072;&#1079;&#1091; &#1086;&#1090;&#1082;&#1072;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1090;&#1082;&#1072;&#1090;&#1072; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.</p>
<p>&nbsp;</p>
<p><span style="font-weight: bold; text-decoration: underline;">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;:</span><br>
&nbsp;<br>
<span style="font-weight: bold;">ADBName</span> - &#1080;&#1084;&#1103; &#1073;&#1072;&#1079;&#1099;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072;:<br>
TSW - &#1073;&#1072;&#1079;&#1072; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1080; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;<br>
BT - &#1073;&#1072;&#1079;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1086;&#1074; &#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084; </p>
<p>PRT - &#1073;&#1072;&#1079;&#1072; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072; &#1076;&#1083;&#1103; &#1095;&#1080;&#1089;&#1090;&#1082;&#1080; &#1080;&#1079; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1083;&#1080;&#1103;&#1102;&#1097;&#1080;&#1093; &#1085;&#1072; &#1087;&#1088;&#1080;&#1074;&#1072;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; (&#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1099;, &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1099;, &#1082;&#1091;&#1082;&#1080;&#1079;&#1099; &#1080; &#1090;.&#1087;.) </p>
<p>&nbsp;</p>
<p>ACheckLevel - &#1087;&#1086;&#1088;&#1086;&#1075; &#1089;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1057;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1090;&#1103;&#1078;&#1077;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1086;&#1090;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; 1 &#1076;&#1086; 3 (1-&#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, 2-&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1081; &#1090;&#1103;&#1078;&#1077;&#1089;&#1090;&#1080;, 3-&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;). &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1084;&#1080; 1..3 &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1085;&#1077; &#1086;&#1090;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;</p>
<p>&nbsp;</p>
<p>AFixLevel - &#1087;&#1086;&#1088;&#1086;&#1075; &#1089;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;. &#1057;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1090;&#1103;&#1078;&#1077;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1087;&#1086;&#1088;&#1086;&#1075;&#1086;&#1084; &#1080; &#1077;&#1089;&#1083;&#1080; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1090;&#1103;&#1078;&#1077;&#1089;&#1090;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1072; &#1087;&#1086;&#1088;&#1086;&#1075;&#1091;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; 1..3, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; -1 &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; ExecuteWizard &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1089;&#1073;&#1086;&#1088;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;</p>
<p>&nbsp;</p>
<p>AUseBackup - &#1077;&#1089;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1088;&#1072;&#1074;&#1077;&#1085; true, &#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1073;&#1072;&#1079;&#1091; &#1086;&#1090;&#1082;&#1072;&#1090;&#1072;</p>
<p>&nbsp;</p>
<p>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;: &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; -1 &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1090;&#1086; &#1086;&#1085;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1077;&#1085; &#1087;&#1086;&#1088;&#1086;&#1075;&#1091; ACheckLevel</p>
<p>&nbsp;</p>
<p><span style="font-weight: bold; text-decoration: underline;">Совместимость:</span></p>
<p>&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 4.28 &#1080; &#1074;&#1099;&#1096;&#1077; </p>
<p><span style="font-weight: bold; text-decoration: underline;">&nbsp;</span></p>
<p><span style="font-weight: bold; text-decoration: underline;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:</span></p>
<p><span class="f_CodeExample" style="font-weight: bold; color: #000000; text-decoration: underline;">&nbsp;</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">var</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;X&nbsp;:&nbsp;integer;</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">begin</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;X&nbsp;:=&nbsp;ExecuteWizard(</span><span class="f_CodeExample" style="color: #000080;">'TSW'</span><span class="f_CodeExample" style="color: #000000;">,&nbsp;2,&nbsp;-1,&nbsp;false);</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;AddToLog(</span><span class="f_CodeExample" style="color: #000080;">'Количество&nbsp;найденных&nbsp;проблем&nbsp;=&nbsp;'</span><span class="f_CodeExample" style="color: #000000;">+inttostr(X));</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">end</span><span class="f_CodeExample" style="color: #000000;">.</span></p>
<p>&nbsp;</p>
<p>Данный скрипт загружает базу TSW (&#1084;&#1072;&#1089;&#1090;&#1077;&#1088; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1080; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;), &#1087;&#1086;&#1088;&#1086;&#1075; &#1089;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1074;&#1077;&#1085; 2, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;.</p>
<p>&nbsp;</p>
<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">var</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;X&nbsp;:&nbsp;integer;</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">begin</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;X&nbsp;:=&nbsp;ExecuteWizard(</span><span class="f_CodeExample" style="color: #000080;">'TSW'</span><span class="f_CodeExample" style="color: #000000;">,&nbsp;2,&nbsp;3,&nbsp;true);</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="color: #000000;">&nbsp;AddToLog(</span><span class="f_CodeExample" style="color: #000080;">'Количество&nbsp;найденных&nbsp;проблем&nbsp;=&nbsp;'</span><span class="f_CodeExample" style="color: #000000;">+inttostr(X));</span></p>
<p class="p_CodeExample"><span class="f_CodeExample" style="font-weight: bold; color: #000000;">end</span><span class="f_CodeExample" style="color: #000000;">.</span></p>
<p>&nbsp;</p>
<p>Данный скрипт загружает базу TSW (&#1084;&#1072;&#1089;&#1090;&#1077;&#1088; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1080; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;), &#1087;&#1086;&#1088;&#1086;&#1075; &#1089;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1074;&#1077;&#1085; 2, &#1087;&#1086;&#1088;&#1086;&#1075; &#1076;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1074;&#1077;&#1085; 3 (&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1103;&#1078;&#1077;&#1083;&#1099;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;), &#1074;&#1085;&#1086;&#1089;&#1080;&#1084;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; &#1074; &#1073;&#1072;&#1079;&#1091; &#1086;&#1090;&#1082;&#1072;&#1090;&#1072;.</p>
<p>&nbsp;</p>


<!--Rating@Mail.ru COUNTER--><script language="JavaScript" type="text/javascript"><!--
d=document;var a='';a+=';r='+escape(d.referrer)
js=10//--></script><script language="JavaScript1.1" type="text/javascript"><!--
a+=';j='+navigator.javaEnabled()
js=11//--></script><script language="JavaScript1.2" type="text/javascript"><!--
s=screen;a+=';s='+s.width+'*'+s.height
a+=';d='+(s.colorDepth?s.colorDepth:s.pixelDepth)
js=12//--></script><script language="JavaScript1.3" type="text/javascript"><!--
js=13//--></script><script language="JavaScript" type="text/javascript"><!--
d.write('<img src="http://top.list.ru/counter'+
'?id=717989;js='+js+a+';rand='+Math.random()+
'" height=1 width=1/>')
if(11<js)d.write('<'+'!-- ')//--></script><noscript><img
src="http://top.list.ru/counter?js=na;id=717989"
height=1 width=1 alt=""/></noscript><script language="JavaScript" type="text/javascript"><!--
if(11<js)d.write('--'+'>')//--></script><!--/COUNTER-->


</body>
</html>
