#include "enumctx.h"

#include <Prague/plugin/p_hash_md5.h>

#include <HOOK\avpgcom.h>
#include <HOOK\HookSpec.h>
#include <HOOK\IDriver.h>

extern
BOOL
OLD_DrvRequest (
	HANDLE hDevice,
	PEXTERNAL_DRV_REQUEST pInRequest,
	PVOID pOutRequest,
	ULONG* OutRequestSize
	);

EnumContext::EnumContext(StartUpEnum2* pStartUpEnum, hOBJECT pSendToObj)
{
	m_cRegEnumCtx=new cRegEnumCtx(pStartUpEnum,pStartUpEnum->m_AppID);
	
	m_pStartUpEnum = pStartUpEnum;
	m_pPrevContext = NULL;
	
	m_SendData.m_dAction=ScanAct;
	m_SendData.m_ObjType=OBJECT_UNKNOWN_TYPE;
	m_SendData.m_sFilePath=L"<unknown>";
	m_SendData.m_sRoot=L"<unknown>";
	m_SendData.m_sSection=L"<unknown>";
	m_SendData.m_sValue=L"<unknown>";
	
	pStartUpEnum->sysCreateObjectQuick((hOBJECT*)&m_hMD5, IID_HASH, PID_HASH_MD5);

	m_pSendToObj = pSendToObj;

	m_pHashClsid=_Hash_InitNew(*pStartUpEnum,8);
	m_pHashInput=_Hash_InitNew(*pStartUpEnum,8);
	m_pHashParse=_Hash_InitNew(*pStartUpEnum,8);
	pFileToDel=NULL;

	m_nLastModify = 0;
	m_dwFlags = 0;

	m_pCurrentWorkingDir = NULL;

	
	m_sFullFilePathName.reserve_len(MAX_PATH);
	m_bAdvancedDisinfection = false;
	m_bCLSIDScanning = false;
}

tERROR EnumContext::SetInfectedObjectName(hSTRING hStrInfectedObject)
{
	tERROR error = errOK;
	hash_t	CRC64;
	tDWORD dSize;

	if (!hStrInfectedObject)
		return errOK;
	m_dwFlags |= CURE_ACTION_ACTIVE;
	m_wFileNames = hStrInfectedObject;
	error=hStrInfectedObject->Length(&dSize);
	dSize++;

		if (m_pStartUpEnum->m_bHashKnownFilesExist)
		{
			bool bFullScan=cFALSE;
			if (errHASH_FOUND != _Hash_Find(m_pStartUpEnum->m_pHashKnownFiles,CRC64.h1,CRC64.h2,&bFullScan))
			{
				PR_TRACE((m_pStartUpEnum,prtNOTIFY,"startupenum2\t<CleanUp> <%S> is not found in m_pHashKnownFiles ",(wchar_t*)m_sFullFilePathName));
				return error=errNOT_FOUND;
			}
			if (bFullScan)
				m_pStartUpEnum->m_bHashKnownFilesExist=0;
		}
	}
	PR_TRACE((m_pStartUpEnum,prtNOTIFY,"startupenum2\t<CleanUp> started for <%S> file",(wchar_t*)m_sFullFilePathName));
	wchar_t* ptr;
	if(ptr=wcsrchr(m_sFullFilePathName,'\\'))
	{
		m_sShortInfectedName = ptr+1;
		if(ptr=wcschr(m_sShortInfectedName, '.'))
			*ptr=0;
		if(ptr=wcschr(m_sShortInfectedName, '~'))
			*ptr=0;
	}

	m_pStartUpEnum->heapAlloc((tPTR*)&pFileToDel,sizeof(UNLOAD_PROFILE_NAMES));
	if (pFileToDel)
	{
		pFileToDel->Count=0;
		pFileToDel->cProfileName[0]=0;
	}
//	_Hash_Done(*m_pStartUpEnum,m_pHashInput);
	_Hash_Done(*m_pStartUpEnum,m_pHashParse);
//	m_pHashInput = NULL;
	m_pHashParse = NULL;
	return error;
}

EnumContext::~EnumContext()
{
	delete m_cRegEnumCtx;

	if (m_pPrevContext)
		return;

	_Hash_Done(*m_pStartUpEnum,m_pHashClsid);
	_Hash_Done(*m_pStartUpEnum,m_pHashInput);
	_Hash_Done(*m_pStartUpEnum,m_pHashParse);
	if (pFileToDel)
	{
		DWORD i;
		DWORD Count=pFileToDel->Count;
		for (i=0;i<Count;i++)
		{
			m_pStartUpEnum->heapFree((void*)pFileToDel->cProfileName[i]);
			pFileToDel->cProfileName[i]=NULL;
		}
		m_pStartUpEnum->heapFree(pFileToDel);
		pFileToDel=NULL;
	}

	if (m_hMD5)
		m_hMD5->sysCloseObject();
}

EnumContext::EnumContext(EnumContext* pSrc)
{
	m_pStartUpEnum = pSrc->m_pStartUpEnum;
	m_cRegEnumCtx=new cRegEnumCtx(m_pStartUpEnum,m_pStartUpEnum->m_AppID);
	m_pPrevContext = pSrc;
	
	m_SendData = pSrc->m_SendData;
	
	m_sFileName = pSrc->m_sFileName;
	m_sFileNameWithExt = pSrc->m_sFileNameWithExt;
	m_sFullFilePathName = pSrc->m_sFullFilePathName;
	m_sLongNameConvert = pSrc->m_sLongNameConvert;
	
	m_sOriginalString = pSrc->m_sOriginalString;
	m_sDefaultValue = pSrc->m_sDefaultValue;
	
	m_hMD5 = pSrc->m_hMD5;
	m_pSendToObj = pSrc->m_pSendToObj;

	m_wFileNames = pSrc->m_wFileNames;

	m_pHashClsid = pSrc->m_pHashClsid;
	m_pHashInput = pSrc->m_pHashInput;
	m_pHashParse = pSrc->m_pHashParse;

	m_nLastModify = pSrc->m_nLastModify;
	m_dwFlags = pSrc->m_dwFlags;

	m_pCurrentWorkingDir = pSrc->m_pCurrentWorkingDir;
	m_bCLSIDScanning = false;
}

bool EnumContext::NeedRescan()
{
	if (m_nLastModify == m_pStartUpEnum->m_nModifyCounter)
		return false;
	m_nLastModify = m_pStartUpEnum->m_nModifyCounter;
	return true;
};

SECTIONS_TYPE EnumContext::GetSectionType(const tCHAR* sSectionName)
{
	if (_stricmp(sSectionName,"REGISTRY_TYPE")==0) return REGISTRY_TYPE;
	if (_stricmp(sSectionName,"INI_TYPE")==0) return INI_TYPE;
	if (_stricmp(sSectionName,"BAT_TYPE")==0) return BAT_TYPE;
	return UNKNOWN;
}


#define MAGIC_ASCC 0x43435341 // 'ASCC'

typedef struct tag_PREFETCH_DATA {
	DWORD dwVersion;           // 0x00 // = 0x11
	DWORD dwMagic;             // 0x04 // = 0x43435341 = 'ASCC'
	DWORD dwDataSize;          // 0x08 // total size
	WCHAR wcImageName[30];     // 0x0C // application image name, "NTOSBOOT" for boot process
	DWORD dwPathHash;          // 0x48 // hash or 0xB00DFAAD for boot process
	DWORD dwUnknown1;          // 0x4C // 1?
	DWORD dwEndOfNamesBlock;   // 0x50 // 
	DWORD dwUnknown2;          // 0x54 // names count?
	DWORD dwNamesOffset;       // 0x58 // start of names block
	DWORD dwNamesCount;        // 0x5C
	DWORD dwVolumesInfoOffset; // 0x60
	DWORD dwVolumesInfoCount;  // 0x64
	DWORD dwUnknown6;          // 0x68 // 0x8E=142
	DWORD dwUnknown7;          // 0x6C // 0
	DWORD dwUnknown8;          // 0x70 // 0xF8D8F200
	DWORD dwUnknown9;          // 0x74 // 0xFFFFFFFF
	DWORD dwUnknown10;         // 0x78 // 0x5650
	DWORD dwUnknown11;         // 0x7C // 0x59FC
	DWORD dwUnknown12;         // 0x80 // 0x1937
	DWORD dwUnknown13;         // 0x84 // 0x3FE
	DWORD dwUnknown14;         // 0x88 // 0x539
	DWORD dwUnknown15;         // 0x8C // 0
	DWORD dwUnknown16;         // 0x90 // 0
	DWORD dwUnknown17;         // 0x94 // 0
	DWORD dwUnknown18;         // 0x98 // 0
	DWORD dwUnknown19;         // 0x9C // 0
	FILETIME ftTimeStamp;      // 0xA0
} PREFETCH_DATA;

typedef struct tag_PREFETCH_NAME_DATA {
	WORD wSize;
	WORD wFlags;
	WCHAR wcName[1];
} PREFETCH_NAME_DATA;

#define PREFETCH_FLAG_DIRECTORY  1

int __cdecl EnumContext::compare_mangled_wstr(const void * arg1, const void * arg2) 
{
	return wcscmp(((tagUnmangledFileName*)arg1)->pData, ((tagUnmangledFileName*)arg2)->pData);
}

bool EnumContext::UnmangledName(WCHAR* pwchBuffer, tagUnmangledFileName& tagName)
{
	// delete unicode prefix
	if (*pwchBuffer && (pwchBuffer[1]=='?' || pwchBuffer[2]=='?'))
	{
		while (pwchBuffer[0] == '\\' || pwchBuffer[0] == '?')
			pwchBuffer++;
	}
	if (0 == _wcsnicmp(pwchBuffer, L"\\Device\\", 8) )
	{
		wchar_t	DrvName[MAX_PATH + 4];
		wchar_t	letter[3];
		
		PR_TRACE((g_root, prtNOTIFY, "startupenum2\t<ScanPrefetchFromDriver> Next image %S", pwchBuffer));
		
		letter[1]=L':';
		letter[2]=0;
		for (wchar_t drv='A';drv<'Z';drv++)
		{
			letter[0]=drv;
			DWORD len;
