/*-----------------16.03.00 15:43----------------------*
 * Project Prague                                      *
 * Subproject kernel internal structures and utilities *
 * Author Andrew Andy Petrovitch                       *
 * Copyright (c) Kaspersky Lab                         *
 * Purpose Prague API                                  *
 * revision 2                                          *
 *-----------------------------------------------------*/


#ifndef __kernel_h
#define __kernel_h


#include <Prague/prague.h>
#include <Prague/pr_vtbl.h>
#include <Prague/iface/i_csect.h>
#include <Prague/iface/i_event.h>
#include <Prague/iface/i_heap.h>
#include <Prague/iface/i_mutex.h>
#include <Prague/iface/i_ifenum.h>
#include <Prague/iface/i_root.h>
#include <Prague/iface/i_plugin.h>
#include <Prague/iface/i_semaph.h>
#include <Prague/iface/i_tracer.h>

#define IMPEX_EXPORT_LIB
#include <Prague/iface/e_ktrace.h>

#ifdef __cplusplus
	extern "C" {
#endif


// forward declaration
typedef struct tag_INTERFACE        tINTERFACE;
typedef struct tag_CustProp         tCustProp;
typedef struct tag_MsgHandler       tMsgHandler;
typedef struct tag_MsgCachedHandler tMsgCachedHandler;
typedef struct tag_OBJECT           tOBJECT;


// ---
typedef struct tag_MHArray {
  tUINT              mcount;   // array size
  tMsgHandler*       parr;     // array memory
} tMHArray;



// ---
typedef struct tag_MHCacheArray {
  tUINT              count;    // array size
  tMsgCachedHandler* parr;     // array memory
} tMHCacheArray;


// ---
// wrapper management
typedef const tPTR (pr_call *OneFuncPtr)( struct sHANDLE* handle, tPTR param, tBOOL ex_in, tDWORD num, tDWORD* data );


// Wrapper structure
typedef struct tag_WRAPPER tWRAPPER;


typedef struct sHANDLEX tHANDLEX;


#if !defined(TraceLevel_defined)
	#define TraceLevel_defined
	typedef struct tag_TraceLevel {
		#if defined(_INTEGRAL_MAX_BITS) && (_INTEGRAL_MAX_BITS >= 64)
			tTRACE_LEVEL max;  //  maximum trace level
			tTRACE_LEVEL min;  //  minimum trace level
		#else
			tWORD   max;  //  maximum trace level
			tWORD   min;  //  minimum trace level
		#endif
	} tTraceLevel;
#endif

// ---
// handle definition structure (kernel point of view)
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// !!!!!!!!!!! ----- if you want to change offsets in this structure            ----- !!!!!!!!!!!!!!!!
// !!!!!!!!!!! ----- do not forget to change OBJ_TR... macros in the "pr_sys.h" ----- !!!!!!!!!!!!!!!!
// !!!!!!!!!!! ----- code in System_ObjectSwap method                           ----- !!!!!!!!!!!!!!!!
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
typedef struct sHANDLE {

	tOBJECT*            obj;              //  0x00-00  0x00 interface defined part of handle
	tINTERFACE*         iface;            //  0x04-01  0x08 pointer to interface decription
	tCustProp*          custom_prop;      //  0x08-02  0x10 custom (external) properties
	tDWORD              custom_prop_count;//  0x0c-03  0x18 custom (external) properties count

	tDWORD              flags;            //  0x10-04  0x1c some flags
	tDWORD              ref;              //  0x14-05  0x20 lock count
	tDWORD              init_props;       //  0x18-06  0x24 initialization property marks
	tHANDLEX*           ext;              //  0x1c-07  0x28 handle extension

	// handle hierarchy related data
	struct sHANDLE*     parent;           //  0x20-08  0x30 parent handle
	struct sHANDLE*     next;             //  0x24-09  0x38 next handle at the same level
	struct sHANDLE*     prev;             //  0x28-10  0x40 prev handle at the same level
	struct sHANDLE*     child;            //  0x2c-11  0x48 first child

	hHEAP               mem;              //  0x30-12  0x50 linked memory heap
	hOBJECT             sync;             //  0x34-13	 0x58 linked synchronized object
	hTRACER             tracer;           //  0x38-14  0x60 tracer handle if tracing turned on
	tTraceLevel         trace_level;      //  0x3c-15  0x68 trace level for this handle

} tHANDLE;


struct sHANDLEX {
	tMHArray      mh_arr;     //  0x00-00  message handler array
	tMHCacheArray mh_c_arr;   //  0x08-02  cached message handlers

	tWRAPPER*     wrappers;   //  0x10-21  wrapper list
	tDWORD        wrap_data;  //  0x14-22  data passed to wrapper method
	tDWORD        wrap_data2; //  0x18-23  data passed to wrapper method 

	tDWORD        user_data;  //  0x1c-04
	tHANDLE*      find_data1; //  0x20-05
	tDWORD        find_data2; //  0x24-06

	tDATA         reserved0;  //  0x28-26
	tDATA         reserved1;  //  0x2c-27
};


#define _chk_ext_0(h) \
	( (h)->ext ? errOK : (_chk_ext_count,PrAlloc(&(h)->ext,sizeof(tHANDLEX))))

#define _chk_ext(po,h,p,e) \
	( (h)->ext ? ((p)=(h)->ext,errOK) : (PR_SUCC((e)=PrAlloc(&(p),sizeof(tHANDLEX))) ? (_chk_ext_count,wlock(po),((h)->ext=p),wunlock(po),e) : e) )


//#define OBJ_WD(o)               ( (tDWORD*)(((tBYTE*)o)-(3*sizeof(tDWORD)+sizeof(hTRACER))) )
#define HDL_TRACER(h)           ( h->tracer )

#define HDL_TR_MAX_LVL(h)       ( h->trace_level.max )
#define HDL_TR_MIN_LVL(h)       ( h->trace_level.min )

#define HDL_TR_MAX_CHK(h,lvl)   (lvl <= HDL_TR_MAX_LVL(h))
#define HDL_TR_MIN_CHK(h,lvl)   (HDL_TR_MIN_LVL(h) <= lvl)
#define HDL_TR_CHK(h,lvl)       (HDL_TR_MAX_CHK(h,lvl) && HDL_TR_MIN_CHK(h,lvl))
#define HDL_TR_CHECK(h,lvl)     (HDL_TRACER(h) && HDL_TR_CHK(h,lvl) )

// handle state flags
#define hf_OPERATIONAL_MODE          0x00000001  // object in operational mode now
