#include <stdio.h>
#include "CrC_User.h"

/*‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹DEFINES*/
/*ﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂR34_10_2001_sizes*/
int CrypC_LR34_10_2001_sizes(struct LR34_10_2001 *Context, int *P_Size, int *Q_Size)
/*ƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒ*/
/*          ÇÎ¢Æ§ ®≠‰Æ‡¨†Ê®® Æ ‡†ß¨•‡†Â Ø†‡†¨•‚‡Æ¢ Ê®‰‡Æ¢Æ© ØÆ§Ø®·®           */
/* ÇÂÆ§≠Î• Ø†‡†¨•‚‡Î:                                                         */
/* - ì™†ß†‚•´Ï ≠† °„‰•‡ ™Æ≠‚•™·‚†: *Context (·‚‡„™‚„‡†).                      */
/* - ì™†ß†‚•´Ï ≠† °„‰•‡ ‡†ß¨•‡† Ø‡Æ·‚Æ£Æ ØÆ‡Ô§™† P: *P_Size.                  */
/* - ì™†ß†‚•´Ï ≠† °„‰•‡ ‡†ß¨•‡† Ø‡Æ·‚Æ£Æ ØÆ‡Ô§™† Q: *Q_Size.                  */
/* ÇÎÂÆ§:                                                                     */
/* - ê†ß¨•‡Î NP ® NQ ¢ °„‰•‡†Â P_Size ® Q_Size, ·ÆÆ‚¢•‚·‚¢•≠≠Æ.               */
/* äÆ§Î ¢Æß¢‡†‚†:                                                             */
/* - RET_OK                - ≠Æ‡¨†´Ï≠Æ• ß†¢•‡Ë•≠®•.                           */
/* - RET_CONTEXTNOTREADY   - ™Æ≠‚•™·‚ ≠• ®≠®Ê®†´®ß®‡Æ¢†≠.                     */
/* - RET_INVALIDPARAMETER  - ≠„´•¢Æ© „™†ß†‚•´Ï ≠† Æ°Ôß†‚•´Ï≠Î© Ø†‡†¨•‚‡.      */
/*ƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒƒ*/
{
         int  Ret;

if(! Context || !P_Size || !Q_Size)
  Ret = RET_INVALIDPARAMETER;
else
if(!(Context->IsReady & R34_10_2001_CONTEXT))
  Ret = RET_CONTEXTNOTREADY;
else
  {
  *P_Size = Context->P_Size;                  /* ê†ß¨•‡ Ø‡Æ·‚Æ£Æ P.           */
  *Q_Size = Context->Q_Size;                  /* ê†ß¨•‡ Ø‡Æ·‚Æ£Æ Q.           */

  Ret = RET_OK;
  }
return(Ret);
}
/*‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹‹R34_10_2001_sizes*/
/*ﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂﬂEOF*/
